#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_dev.module.onestopauth.module.client_aug-17-test-email-596.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=16114c49-375c-4629-abe5-55c7872d069a]
module.keycloak_dev.module.onestopauth.module.client_aug-17-test-email-596.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=7f371c35-b184-435e-8750-3a4c551754bd]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=203caf5b-7262-4a5e-95e1-2016477c08ce]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=fdd1b368-149a-4755-899c-397f192c302d]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b3a2ad3e-de7d-4181-bfd5-3f883f0f7620]
module.keycloak_dev.module.onestopauth.module.client_create-test-02-09-2021-1454.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=84acfc08-9671-4f2f-af87-ee4d42cd6692]
module.keycloak_dev.module.onestopauth.module.client_create-test-02-09-2021-1454.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=fb81e956-1575-4ff1-beb3-7d95d529a80d]
module.keycloak_dev.module.onestopauth.module.client_create-test-02-09-2021-1454.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f2e9fc82-3372-46e1-8eb5-ee421bc0cefb]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=bde3707f-383d-4d20-a79d-e4c4f7931b1f]
module.keycloak_dev.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2b69c1a3-2c26-488c-88e9-3ad41345dcae]
module.keycloak_dev.module.onestopauth.module.client_cypress-test-1651.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=1c98999a-8146-44a6-83a1-ebfe31d04f97]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=5ea88be0-05eb-4cb4-b2d5-611e99f35b30]
module.keycloak_dev.module.onestopauth.module.client_cypress-test-1651.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=351edce8-24a2-4788-a2d0-fb683e0d86c8]
module.keycloak_dev.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=33aafe72-f21e-4325-a629-9ab2762ae58e]
module.keycloak_dev.module.onestopauth.module.client_cypress-test-1651.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=0aa8bbff-cf4a-4079-a4b9-e068d4a23a29]
module.keycloak_dev.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=0e8cf9c4-21fd-40c0-bbab-aa919486f2bf]
module.keycloak_dev.module.onestopauth.module.client_3-test-for-v-1-238.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=513dd0b4-cef9-4c2b-85d1-afbdc330fd75]
module.keycloak_dev.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=ddf4a5f5-be5f-44a7-b6e5-382ea1098b6a]
module.keycloak_dev.module.onestopauth.module.client_create-test-02-09-2021-1454.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=2262ceb4-3fd5-48ed-9168-1df9b9b60926]
module.keycloak_dev.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=1bf74a67-5f9a-44e2-acf4-398d92978a21]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=7af5bb55-d337-43fe-b601-35dfceb6b9ce]
module.keycloak_dev.module.onestopauth.module.client_create-test-02-09-2021-1454.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ea115985-a22b-497a-b01b-562bf9aa81de]
module.keycloak_dev.module.onestopauth.module.client_cypress-test-1651.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=82ee2743-d087-4731-99e8-70588207b11a]
module.keycloak_dev.module.onestopauth.module.client_create-test-02-09-2021-1454.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=417b36ed-a7aa-4d6b-b435-800bde68b534]
module.keycloak_dev.module.onestopauth.module.client_cypress-test-1651.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=74f44654-4961-4268-ab51-3ae574413368]
module.keycloak_dev.module.onestopauth.module.client_cypress-test-1651.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=af50e464-c02f-4992-bfb6-3c31435b03ef]
module.keycloak_dev.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=af70a806-df72-4c9f-a6c4-0cef832e279e]
module.keycloak_dev.module.onestopauth.module.client_august-17th-4-pm-599.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=a8f0845d-3dcc-4f68-ac43-6aed7c24585b]
module.keycloak_dev.module.onestopauth.module.client_august-17th-4-pm-599.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b1aee37e-eca0-4bd4-95f5-44ae0a90e483]
module.keycloak_dev.module.onestopauth.module.client_3-test-for-v-1-238.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=148764a7-f8a4-4558-a123-f9db33bcc902]
module.keycloak_dev.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=682c10c9-f4d3-4278-84ea-66c919fa4de2]
module.keycloak_dev.module.onestopauth.module.client_3-test-for-v-1-238.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=bce81f4d-890e-43e7-a7ff-ce6106c771a6]
module.keycloak_dev.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=812c929b-2a36-4515-8347-23b3b02485c3]
module.keycloak_dev.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b8feccbc-035d-4aa1-9699-50ecd51667bf]
module.keycloak_dev.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=c0369e84-01ea-42c2-9c88-c8b1c93a8123]
module.keycloak_dev.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=fbb0aa2d-e4bb-4df0-8970-77c44a506b46]
module.keycloak_dev.module.onestopauth.module.client_august-17th-4-pm-599.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=6971a234-3a0e-47e2-b549-e8a7ae5e367d]
module.keycloak_dev.module.onestopauth.module.client_august-17th-4-pm-599.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=0dd83f5c-feb0-4ac6-89a3-88b1363ef7fa]
module.keycloak_dev.module.onestopauth.module.client_august-17th-4-pm-599.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=290220ea-ef5f-4ac6-b0e5-b88166663764]
module.keycloak_dev.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d610bd0d-e2f4-48a1-a845-29ea1044e92f]
module.keycloak_dev.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=38d3dd6c-7180-480a-8c32-8c48e7dcfadf]
module.keycloak_dev.module.onestopauth.module.client_3-test-for-v-1-238.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8531c139-f8b1-4524-a352-db32462c4d0f]
module.keycloak_dev.module.onestopauth.module.client_3-test-for-v-1-238.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=55965535-2463-4e68-8475-e420272ec3f5]
module.keycloak_dev.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=75087273-e5b5-4ade-b157-70c6ebe829b8]
module.keycloak_dev.module.onestopauth.module.client_august-17th-4-pm-599.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d058fe11-6224-4fc5-97c2-62988aef65f2]
module.keycloak_dev.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=b4043d02-4132-4deb-b0ff-719e959bb797]
module.keycloak_dev.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=3c8cd887-f06a-411f-bec9-039161e03970]
module.keycloak_dev.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=1772ede9-79d6-484d-a32b-8f27a3ff202e]
module.keycloak_dev.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a849cfea-06c5-4c7a-96d4-b129ed4ef14f]
module.keycloak_dev.module.onestopauth.module.client_3-test-for-v-1-238.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=33d1d963-da89-4797-b1c9-1fb3095e4b06]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth.module.client_cypress-test-1686.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_cypress-test-1686.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_cypress-test-1686.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_cypress-test-1686.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "cypress-test-1686"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_cypress-test-1686.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_cypress-test-1686.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_cypress-test-1686.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "cypress-test-1686"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "cypress-test-1686"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://cypress",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_prod.module.onestopauth.module.client_cypress-test-1686.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_cypress-test-1686.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_cypress-test-1686.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_cypress-test-1686.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "cypress-test-1686"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_cypress-test-1686.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_cypress-test-1686.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_cypress-test-1686.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "cypress-test-1686"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "cypress-test-1686"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://cypress",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1686.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1686.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1686.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1686.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "cypress-test-1686"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1686.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1686.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1686.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "cypress-test-1686"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "cypress-test-1686"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://cypress",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

Plan: 21 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 2009 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*